app/controllers/dashboard_controller.rb

  def index
    @challenge = Challenge.first
---
SELECT "challenges".* FROM "challenges" ORDER BY "challenges"."id" ASC LIMIT 1